# Документаційні рядки
# • Рядок, що стоїть на початку функції (а також модуля, класу або методу),
# відіграє роль особливого виду коментарів – документаційного рядка(docstring).
# • На відміну від звичайних коментарів, до документаційних рядків можна
# отримати доступ під час виконання програми.
# • Безпосередній доступ до документаційних рядків здійснюється шляхом
# звернення до поля __doc__ відповідних об'єктів.
# • При використанні інтерпретатора в інтерактивному режимі зручно
# використовувати функцію help.

def function():
    """Рядок, що стоїть на початку функції (а також модуля, класу або методу),
відіграє роль особливого виду коментарів – документаційного рядка (docstring).
    """
    print('function called\n\n')


function()

# Виведення документаційного рядка на екран.
# Після імені функції немає круглих дужок, тому вона не викликається,
# а сама розглядається як певний об'єкт
print(function.__doc__)

# Функція help служить для виведення довідки
help(function)
help(print)
