from functools import lru_cache, partial

# Модуль functools містить велику кількість стандартних функцій вищого порядку.
# Деякі з них:
# - reduce - розглянута раніше;

# - lru_cache - декоратор, що кешує значення функцій, які не змінюють свій
# результат за незмінних аргументів; корисний для кешування даних, мемоїзації
# (збереження результатів для повернення без обчислення функції) значень
# рекурсивних функцій (наприклад, такого типу, як функція обчислення n-го числа
# Фібоначчі) тощо;
@lru_cache(maxsize=None)
def fibonacci(index):
    if index < 2:
        return 1
    else:
        return fibonacci(index - 1) + fibonacci(index - 2)


for i in range(1, 10):
    print(fibonacci(i))

# - partial - часткове застосування функції (виклик функції з меншою кількістю
# аргументів, ніж вона очікує, і отримання функції, яка приймає параметри, що
# залишилися).
print_with_comma = partial(print, sep=', ')
print_with_comma(2, 3, 5)
